# GetAllDampers Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetAllDampers Method
FabricationConfiguration Class See Also
---
Gets all damper identifiers in the fabrication configuration.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public IList<int> GetAllDampers()
```

Visual Basic
---
```text
Public Function GetAllDampers As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ GetAllDampers()
```

# ### Return Value
An array of specification identifiers.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace